Revit 2027 API
TessellatedShapeBuilder.CancelConnectedFaceSet Method
 Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CancelConnectedFaceSet()
Public Sub CancelConnectedFaceSet
public:
void CancelConnectedFaceSet()
member CancelConnectedFaceSet : unit -> unit
Remarks
 This function can be safely called upon builder without an open face set.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace